I hit this exact same issue. I took your example config, removed the `azurerm_role_assignment` resource, and just ran a `terraform plan` against it to see the output.

```
  # azurerm_kubernetes_cluster.main will be created
  + resource "azurerm_kubernetes_cluster" "main" {
      + api_server_authorized_ip_ranges     = (known after apply)
      + current_kubernetes_version          = (known after apply)
      + dns_prefix                          = "exampleaks1"
  ...
      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + kubelet_identity (known after apply)

      + network_profile (known after apply)

      + windows_profile (known after apply)
    }
```

Using your example tftest.hcl file, again with the role assignment removed, I ran `terraform test -verbose` to see what plan it was generating. Notice how the `kubelet_identity`, `network_profile`, etc are all missing?

```
  # azurerm_kubernetes_cluster.main will be created
  + resource "azurerm_kubernetes_cluster" "main" {
      + api_server_authorized_ip_ranges    = (known after apply)
      + current_kubernetes_version         = (known after apply)
      + dns_prefix                         = "exampleaks1"
  ...
      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }
```

I'm not sure if this is an issue with `terraform test` or the `azurerm_kubernetes_cluster` resource, but something is definitely broken here.